[
  {
    "word": "Rajamouli",
    "description": "Indian cinema ni global playground lo pettina filmmaker. Vision, discipline, emotional scale—ikkada already decode chesam. Inka deeper breakdowns vastayi. CineTechFlow subscribe chesthe cinema ela engineer chestaro telusthadi."
  },
  {
    "word": "Sukumar",
    "description": "Character depth and psychological layers tho cinema ni next level ki teesina director. Writing lo detail chala sharp ga untadi. CineTechFlow lo Sukumar storytelling ni deep dive chestham."
  },
  {
    "word": "Trivikram",
    "description": "Dialogues tho emotion, philosophy tho entertainment. Simple scenes lo kuda weight untadi. CineTechFlow lo writing power ela work avuthundo break chestham."
  },
  {
    "word": "Puri Jagannadh",
    "description": "Attitude-driven cinema. Pace, punch dialogues, raw energy—oka clear style. Ee style ela connect avuthundo CineTechFlow lo decode chestham."
  },
  {
    "word": "Nag Ashwin",
    "description": "Modern ideas + rooted emotion. Scale ni content tho balance chese new-age director. CineTechFlow lo future Indian cinema discussion lo important name."
  },
  {
    "word": "Vanga",
    "description": "Polarizing but uncompromising voice. Emotion ni comfort zone bayataki teesukelle cinema. CineTechFlow lo controversy kaadu—craft ni analyze chestham."
  },
  {
    "word": "Christopher Nolan",
    "description": "Cinema ni experience ga treat chese director. IMAX obsession, layered narratives—already explored. CineTechFlow lo Nolan cinema enduku work avuthundo clarity vastadi."
  },
  {
    "word": "Spielberg",
    "description": "Emotion ni camera tho cheppadam evarikaina raadu. Wonder, rhythm, heart—idi storytelling masterclass. CineTechFlow lo cinema feeling ela create avuthundo telusthadi."
  },
  {
    "word": "Scorsese",
    "description": "Characters, chaos, consequences. Raw human behavior ni cinema language lo chupinche master. CineTechFlow lo surface reviews kaadu, deep analysis untadi."
  },
  {
    "word": "Prabhas",
    "description": "Scale ni redefine chesina actor. Borders, language, expectations—all broken. CineTechFlow lo ee journey ni bigger cinema landscape lo decode chestham."
  },
  {
    "word": "Mahesh Babu",
    "description": "Subtle performance + star presence. Silence lo kuda impact create chese screen language. CineTechFlow lo stardom evolution ni breakdown chestham."
  },
  {
    "word": "Allu Arjun",
    "description": "Movement, rhythm, mass connect. Style tho paatu craft. Pan-India appeal ela build ayindho CineTechFlow lo analyze chestham."
  },
  {
    "word": "NTR",
    "description": "Raw intensity and emotional firepower. Performance-driven cinema ki strong example. CineTechFlow lo acting craft ni deep ga explore chestham."
  },
  {
    "word": "Ram Charan",
    "description": "Physical transformation, discipline, global readiness. Cinema lo presence ela mature ayindho CineTechFlow lo decode chestham."
  },
  {
    "word": "Chiranjeevi",
    "description": "Indian mass cinema foundation. Stardom ela build ayindho, ela decades varaku survive ayindho CineTechFlow lo explain chestham."
  },
  {
    "word": "IMAX",
    "description": "Screen kaadu—experience. Scale and immersion story ni ela elevate chestayo CineTechFlow lo clear ga explain chestham."
  },
  {
    "word": "VFX",
    "description": "Kanipinchakunda work chese craft. Story ni serve chesthe magic, lekapothe distraction. CineTechFlow lo ee difference clear ga chupistham."
  },
  {
    "word": "Cinematography",
    "description": "Light, framing, movement—dialogue mundhe emotion create chese language. CineTechFlow lo visuals ela matladuthayo telusthadi."
  },
  {
    "word": "Editing",
    "description": "Cinema malli rasukune stage. Rhythm and timing decide impact. CineTechFlow lo films ela shape avuthayo breakdown untadi."
  },
  {
    "word": "Screenplay",
    "description": "Every great film ki backbone. Scale kanna structure important. CineTechFlow lo story enduku work avuthundo analyze chestham."
  },
  {
    "word": "Avatar",
    "description": "World-building and technology-driven storytelling ki benchmark. Modern cinema ni deep ga influence chesina film. CineTechFlow lo detailed breakdown untadi."
  },
  {
    "word": "RRR",
    "description": "Emotion + spectacle global ga connect avuthayi ani prove chesina film. CineTechFlow lo ee success anatomy ni decode chestham."
  },
  {
    "word": "Baahubali",
    "description": "Indian cinema ambition ni redefine chesina turning point. Scale emotion tho ela blend ayindho CineTechFlow lo explain chestham."
  },
  {
    "word": "Oppenheimer",
    "description": "Ideas tho tension create chesina film. Action lekunda impact ela vastundo CineTechFlow lo cinema language lo break chestham."
  },
  {
    "word": "Sound Design",
    "description": "Manam realize avvakunda feel ayye craft. Fear, awe, silence—anni sound tho build avuthayi. CineTechFlow lo ears tho cinema ardham cheskuntaru."
  },
  {
    "word": "Color Grading",
    "description": "Mood and tone subconscious ga set chese power. Kanipinchadu, kaani effect strong. CineTechFlow lo colors storytelling ela chestayo telusthadi."
  },
  {
    "word": "AI",
    "description": "Creativity ni reshape chestunna tool. Cinema, content, future—anni change avuthunnayi. CineTechFlow lo ee shift ni early ga decode chestham."
  },
  {
    "word": "Algorithms",
    "description": "Visibility and reach ni decide chese invisible system. Creators ki idi ardham avvali. CineTechFlow lo growth logic ni explain chestham."
  },
  {
    "word": "Storytelling",
    "description": "Technology maarina, platforms maarina—stories gelusthayi. CineTechFlow lo story power ni core level lo analyze chestham."
  },
  {
    "word": "Cinema",
    "description": "Art, technology, emotion—oka fusion. Ee channel ee fusion ni decode cheyadanike exist avuthundi. CineTechFlow subscribe cheyandi."
  },
  {
    "word": "Creators",
    "description": "Ideas ni reality ga marchese people. Growth, mistakes, learning—anni openly discuss chestham. CineTechFlow builders kosam."
  }
]
